code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаКотировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКотировок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТаблицаДанных</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодЗагрузки</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/Котировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Котировки</Name>
			<Comment>Котировки ценных бумаг</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>value</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OpenPeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Open</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Low</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>High</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>last_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LowOffer</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HighBid</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WAPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClosePeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendClose</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendWAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Bid</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Offer</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Prev</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YieldAtWAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YieldClose</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Nkd</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AccInt</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяЦена</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>trades_num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueSize</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendClsPr</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendWapPr</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MatDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MarketPrice2</Name>
					<Comment>Для расчета рыночной стоимости активов, в которые инвестированы средства пенсионных накоплений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнаваемаяКотировка</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КотировальныйЛист</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PrevLegalClosePrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LegalOpenPrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LegalClosePrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OpenVal</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CloseVal</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Залог</Name>
					<Comment>Размер ДС, блокируемых под одну позицию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MarketPrice3</Name>
					<Comment>Для расчета рыночной стоимости активов, в которые инвестированы средства пенсионных накоплений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>indicative_price</Name>
					<Comment>для загрузки индикативной цены из CBonds</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВалютаКотировки</Name>
					<Comment>Валюта котировки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевойНКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКотировкаОсновногоИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимТоргов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыТоргов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиКотировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Календарь</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Мы работаем по графику ММВБ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЦБРФ</Name>
					<Comment>Не рабочий день по обычному производственному календарю РФ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаКотировок/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

Перем мКешВалют;				 // Соотвествие наименования валюты и ссылки на валюту
Перем мСоответствиеПолейММВБ;	 // Соотвествие поля котировки файла и поля регистра котировок

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура - Выполнить загрузку
//
// Параметры:
//  Действие		 - Строка - Название алгоритма загрузки котировки
//  ПериодЗагрузки	 - СтандартныйПериод - Период загрузки котировок
//
Процедура ВыполнитьЗагрузку(Действие, ПериодЗагрузки) Экспорт
	
	ТабличныйДокумент = НовыйЛог(Действие);
	ОбластьОшибка = ОбластьМакета("Ошибка");
	Отказ = Ложь;
	ТекстОтказа = "";
	НовыеРежимыТоргов = Новый Массив;
	
	ЗагрузитьДанныеВТаблицу(Действие, ПериодЗагрузки, НовыеРежимыТоргов, Отказ, ТекстОтказа);
	Если Отказ Или ЗначениеЗаполнено(ТекстОтказа) Тогда
		ОбластьОшибка.Параметры.ОписаниеОшибки = ТекстОтказа;
		ТабличныйДокумент.Вывести(ОбластьОшибка);
		
		Если ЗначениеЗаполнено(НовыеРежимыТоргов) Тогда
			ОбластьШапкаРежимыТоргов = ОбластьМакета("ШапкаРежимыТоргов");
			ТабличныйДокумент.Вывести(ОбластьШапкаРежимыТоргов);
			ОбластьСтрокаРежимТоргов = ОбластьМакета("СтрокаРежимТоргов");
			Для Каждого НовыйРежимТоргов Из НовыеРежимыТоргов Цикл
				ОбластьСтрокаРежимТоргов.Параметры.НовыйРежимТорговКод	 = НовыйРежимТоргов.Код;
				ОбластьСтрокаРежимТоргов.Параметры.НовыйРежимТоргов		 = НовыйРежимТоргов.Ссылка;
				ТабличныйДокумент.Вывести(ОбластьСтрокаРежимТоргов);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		ЗагрузитьКотировкиИзТаблицы(Действие, ПериодЗагрузки, НовыеРежимыТоргов, Отказ, ТекстОтказа, ТабличныйДокумент);
	КонецЕсли;
	
	Если Не ТестированиеVanessa.ЭтоТест() Тогда
		ИсточникРассылки = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОЗагрузкеКотировокММВБ;
		РассылкаОтчетов.ОтправитьТабличныйДокументОтчетКакУведомлениеHTML(ИсточникРассылки,
			Действие, ТабличныйДокумент, ПериодЗагрузки.ДатаНачала);
	КонецЕсли;
	
	Если Отказ Тогда
		ВызватьИсключение ТекстОтказа;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает табличный документ лог файла
//
// Параметры:
//  Действие - Строка	 - Название алгоритма загрузки котировки
// 
// Возвращаемое значение:
//   - ТабличныйДокумент - Лог
//
Функция НовыйЛог(Действие) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ОтображатьГруппировки = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	Макет = Обработки.ЗагрузкаКотировок.ПолучитьМакет("Лог");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Действие = Действие;
	ОбластьШапка.Параметры.Сформирован = "Сформирован (1с): " + ТекущаяДатаСеанса();
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Возвращает указанную область табличного документа лог файла
//
// Параметры:
//  ИмяОбласти	 - Строка	 - Имя возвращаемой области макета Лог
// 
// Возвращаемое значение:
//   - Область - Область табличного документа
//
Функция ОбластьМакета(ИмяОбласти) Экспорт
	
	Макет = Обработки.ЗагрузкаКотировок.ПолучитьМакет("Лог");
	Область = Макет.ПолучитьОбласть(ИмяОбласти);
	
	Возврат Область;
	
КонецФункции

// Процедура - Загрузить данные в таблицу
//
// Параметры:
//  Действие			 - Строка		 - Название алгоритма загрузки котировки
//  ПериодЗагрузки		 - СтандартныйПериод - Период загузки котировок
//  НовыеРежимыТоргов	 - Массив			 - Массив новых режимов торгов, созданных данной процедурой
//  Отказ				 - Булево			 - Отказ
//  ТекстОтказа			 - Строка			 - Текст отказа
//
Процедура ЗагрузитьДанныеВТаблицу(Действие, ПериодЗагрузки, НовыеРежимыТоргов, Отказ, ТекстОтказа) Экспорт
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ВременныйКаталогФайловКотировок =
		ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
	СоздатьКаталог(ВременныйКаталогФайловКотировок);
	
	Попытка
		ТолькоРабочиеДни = Истина;
		ТаблицаПериодов = ПолучитьПериоды(ПериодЗагрузки.ДатаНачала, ПериодЗагрузки.ДатаОкончания, ТолькоРабочиеДни);
		РежимыТорговMAIN = Справочники.РежимыТоргов.ОсновныеРежимыТорговММВБ("Код");
		ФайлыНеНайдены = Истина;
		
		ТаблицаДанных.Очистить();
		ТаблицаДанных.Индексы.Добавить("TradeDate, BoardId, SecurityId, RegNumber");
		ТаблицаДанных.Индексы.Добавить("TradeDate, SecurityId, RegNumber");
		
		Для Каждого Период Из ТаблицаПериодов Цикл
			
			ДатаКотировки = Период.РезультирующаяДата;
			ДатаКотировкиСтрокой = Формат(ДатаКотировки, "ДЛФ=D");
			
			Если Действие = "ФайлММВБ" Тогда
				
				УдалитьФайлы(ВременныйКаталогФайловКотировок, "*.*");
				НайденыКотировки = ЕстьФайлыКотировокММВБ(ДатаКотировки, ВременныйКаталогФайловКотировок);
				ФайлыНеНайдены = ФайлыНеНайдены И Не НайденыКотировки;
				Если НайденыКотировки Тогда
					
					МассивНайденных = НайтиФайлы(ВременныйКаталогФайловКотировок, "*.*");
					ПараметрыЗагрузки =
						Новый Структура("ДатаКотировки, ДатаКотировкиСтрокой, РежимыТорговMAIN", ДатаКотировки, ДатаКотировкиСтрокой, РежимыТорговMAIN);
					ЗагрузитьДанныеВТаблицуММВБ(Действие, ТаблицаДанных, НовыеРежимыТоргов, Отказ, ТекстОтказа, МассивНайденных, ПараметрыЗагрузки);
					
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ФайлыНеНайдены Тогда
			// Так как регламент читает котировки за рабочие дни,
			// то файл котировок обязан существовать (иначе это ошибка)
			Отказ = Истина;
			ШаблонТекстаОтказа = "В каталоге [%1] за период [%2-%3] не найдены файлы SEM21 с котировками ММВБ";
			ТекстОтказа = СтрШаблон(ШаблонТекстаОтказа,
				КаталогДанных,
				Формат(ПериодЗагрузки.ДатаНачала, "ДФ=ддММгг"),
				Формат(ПериодЗагрузки.ДатаОкончания, "ДФ=ддММгг"));
		КонецЕсли;
		
	Исключение
		Отказ = Истина;
		ТекстОтказа = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	УдалитьФайлы(ВременныйКаталогФайловКотировок);
	
	ВесЗамера = ТаблицаДанных.Количество();
	ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяОбъекта() + "." + Действие + ".Прочитать",
		ВремяНачалаФормирования, ВесЗамера);
	
КонецПроцедуры

// Процедура - Загрузить котировки из таблицы
//
// Параметры:
//  Действие			 - Строка			 - Название алгоритма загрузки котировки
//  ПериодЗагрузки		 - СтандартныйПериод - Период загузки котировок
//  НовыеРежимыТоргов	 - Массив			 - Массив новых режимов торгов, созданных данной процедурой
//  Отказ				 - Булево			 - Отказ
//  ТекстОтказа			 - Строка			 - Текст отказа
//  ТабличныйДокумент	 - ТабличныйДокумент - Лог
//
Процедура ЗагрузитьКотировкиИзТаблицы(Действие, ПериодЗагрузки, НовыеРежимыТоргов, Отказ, ТекстОтказа, ТабличныйДокумент) Экспорт
	
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ОбластьОшибка = ОбластьМакета("Ошибка");
	ОбластьСтрока = ОбластьМакета("Строка");
	ОбластьСтрокаОбработан = ОбластьМакета("СтрокаОбработан");
	ОбластьШапкаРежимыТоргов = ОбластьМакета("ШапкаРежимыТоргов");
	ОбластьСтрокаРежимТоргов = ОбластьМакета("СтрокаРежимТоргов");
	
	Попытка
		Если Действие = "ФайлММВБ" Тогда
			ЦенныеБумагиMOEX = АктуальныеЦенныеБумагиMOEX(ПериодЗагрузки.ДатаОкончания, ТаблицаДанных);
		КонецЕсли;
		
		ТолькоРабочиеДни = Истина;
		ТаблицаПериодов = ПолучитьПериоды(ПериодЗагрузки.ДатаНачала, ПериодЗагрузки.ДатаОкончания, ТолькоРабочиеДни);
		
		ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
		Для Каждого Период Из ТаблицаПериодов Цикл
			
			ДатаЗагрузки = Период.РезультирующаяДата;
			
			мКешВалют = Справочники.Валюты.КешВалют(ДатаЗагрузки);
			
			РегистрыСведенийКотировки = РегистрыСведений.Котировки.СоздатьНаборЗаписей();
			РегистрыСведенийКотировки.Отбор.Период.Установить(ДатаЗагрузки);
			Если Действие = "ФайлММВБ" Тогда
				РегистрыСведенийКотировки.Отбор.Биржа.Установить(Справочники.Биржи.MICEX);
				ТаблицаКотировокЦенныхБумаг = РегистрыСведенийКотировки.ВыгрузитьКолонки();
				
				ЗаполнитьТаблицуКотировокЦенныхБумаг(ТаблицаКотировокЦенныхБумаг, ЦенныеБумагиMOEX, ДатаЗагрузки, ТаблицаДанных);
				
			Иначе
				РегистрыСведенийКотировки.Отбор.Биржа.Установить(Справочники.Биржи.ПустаяСсылка());
				ТаблицаКотировокЦенныхБумаг = РегистрыСведенийКотировки.ВыгрузитьКолонки();
				
			КонецЕсли;
			
			ТаблицаКотировокЦенныхБумагКоличество = ТаблицаКотировокЦенныхБумаг.Количество();
			
			Если ТаблицаКотировокЦенныхБумагКоличество > 0 Тогда
				РегистрыСведенийКотировки.Очистить();
				РегистрыСведенийКотировки.Загрузить(ТаблицаКотировокЦенныхБумаг);
				РегистрыСведенийКотировки.Записать();
			КонецЕсли;
			
			// Выводим лог по созданным документам
			ПериодОбъект = Формат(ДатаЗагрузки, "ДЛФ=DD");
			Если ТаблицаКотировокЦенныхБумагКоличество > 0 Тогда
				ОбластьВыводаРезультатовЗагрузки = ОбластьСтрока;
				Статус							 = "Записан";
				РезультатЗагрузки				 = "ОК. Получены";
			Иначе
				ОбластьВыводаРезультатовЗагрузки = ОбластьСтрокаОбработан;
				Статус							 = "Обработан";
				РезультатЗагрузки				 = "НЕТ ДАННЫХ";
			КонецЕсли;
			ШаблонКомментария = "Результат:[%1] котировки из [%2] по [%3] ЦБ.";
			ОбластьВыводаРезультатовЗагрузки.Параметры.ПериодОбъект				 = ПериодОбъект;
			ОбластьВыводаРезультатовЗагрузки.Параметры.ПериодОбъектРасшифровка	 = ПериодОбъект;
			ОбластьВыводаРезультатовЗагрузки.Параметры.Статус					 = Статус;
			ОбластьВыводаРезультатовЗагрузки.Параметры.Комментарий				 = СтрШаблон(ШаблонКомментария,
				РезультатЗагрузки, Действие, ТаблицаКотировокЦенныхБумагКоличество);
			ТабличныйДокумент.Вывести(ОбластьВыводаРезультатовЗагрузки, 0);
			
		КонецЦикла;
		ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		
	Исключение
		Отказ = Истина;
		ТекстОтказа = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если Отказ Тогда
		ОбластьОшибка.Параметры.ОписаниеОшибки = ТекстОтказа;
		ТабличныйДокумент.Вывести(ОбластьОшибка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыеРежимыТоргов) Тогда
		ТабличныйДокумент.Вывести(ОбластьШапкаРежимыТоргов);
		Для Каждого НовыйРежимТоргов Из НовыеРежимыТоргов Цикл
			ОбластьСтрокаРежимТоргов.Параметры.НовыйРежимТорговКод	 = НовыйРежимТоргов.Код;
			ОбластьСтрокаРежимТоргов.Параметры.НовыйРежимТоргов		 = НовыйРежимТоргов.Ссылка;
			ТабличныйДокумент.Вывести(ОбластьСтрокаРежимТоргов);
		КонецЦикла;
	КонецЕсли;
	
	ВесЗамера = ТаблицаДанных.Количество();
	ОценкаПроизводительности.ЗакончитьЗамерВремени(ИмяОбъекта() + "." + Действие + ".Записать",
		ВремяНачалаФормирования, ВесЗамера);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьДанныеВТаблицуММВБ(Действие, ТаблицаДанных, НовыеРежимыТоргов, Отказ, ТекстОтказа, МассивНайденных, ПараметрыЗагрузки)
	
	ДатаКотировкиСтрокой = ПараметрыЗагрузки.ДатаКотировкиСтрокой;
	
	Для Каждого Файл Из МассивНайденных Цикл
		ИмяФайла = Файл.Имя;
		ПолноеИмяФайла = Файл.ПолноеИмя;
		
		ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова("File = " + ИмяФайла, Действие);
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
		
		ЧтениеФайла = Новый ЧтениеXML;
		ЧтениеФайла.ОткрытьФайл(ПолноеИмяФайла);
		Попытка
			Элемент = ФабрикаXDTO.ПрочитатьXML(ЧтениеФайла);
			РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, ДатаКотировкиСтрокой);
		Исключение
			Отказ = Истина;
			ТекстОтказа
				= НСтр("ru = 'Не удалось прочитать файл " + ИмяФайла + ". Техническая информация: " + ОписаниеОшибки() + "'");
			РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа, ДатаКотировкиСтрокой);
		КонецПопытки;
		ЧтениеФайла.Закрыть();
		
		Если Отказ Тогда
			ВызватьИсключение ТекстОтказа;
		КонецЕсли;
		
		Sem21Session = Элемент.SEM21.SESSION;
		Если ТипЗнч(Sem21Session) = Тип("ОбъектXDTO") Тогда
			Sem21Session = Новый Массив;
			Sem21Session.Добавить(Элемент.SEM21.SESSION);
		КонецЕсли;
		НомерСессии = Sem21Session.Количество();
		Пока НомерСессии > 0 Цикл
			Сессия = Sem21Session.Получить(НомерСессии - 1);
			Sem21Boards = Сессия.BOARD;
			Если ТипЗнч(Sem21Boards) = Тип("ОбъектXDTO") Тогда
				Sem21Boards = Новый Массив;
				Sem21Boards.Добавить(Сессия.BOARD);
			КонецЕсли;
			
			ПараметрыЗагрузки.Вставить("Sem21Boards", Sem21Boards);
			ПараметрыЗагрузки.Вставить("ИмяФайла"	, ИмяФайла);
			ЗагрузитьДанныеВТаблицуММВБПоРежимамТоргов(Действие, ТаблицаДанных, НовыеРежимыТоргов, ПараметрыЗагрузки);
			
			НомерСессии = НомерСессии - 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеВТаблицуММВБПоРежимамТоргов(Действие, ТаблицаДанных, НовыеРежимыТоргов, ПараметрыЗагрузки)
	
	ДатаКотировки		 = ПараметрыЗагрузки.ДатаКотировки;
	РежимыТорговMAIN	 = ПараметрыЗагрузки.РежимыТорговMAIN;
	Sem21Boards			 = ПараметрыЗагрузки.Sem21Boards;
	ИмяФайла			 = ПараметрыЗагрузки.ИмяФайла;
	
	Для Каждого РежимТоргов Из Sem21Boards Цикл
		Если Не ВРЕГ(РежимТоргов.BoardType) = "MAIN" Тогда
			Продолжить;
		КонецЕсли;
		ЭтоНовыйРежимТоргов = Неопределено;
		РежимТорговСсылка = ОбновитьРежимТоргов(РежимТоргов, ЭтоНовыйРежимТоргов);
		Если ЭтоНовыйРежимТоргов И РежимТорговСсылка.ТипРежимаТоргов = Справочники.ТипыРежимовТоргов.MAIN Тогда
			НовыеРежимыТоргов.Добавить(РежимТорговСсылка);
			// Переопределим список основных режимов торгов
			РежимыТорговMAIN = Справочники.РежимыТоргов.ОсновныеРежимыТорговММВБ("Код");
		КонецЕсли;
		Если РежимыТорговMAIN.Найти(РежимТоргов.BOARDID) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗагрузитьДанныеВТаблицуДетально(Действие,
			ТаблицаДанных, ДатаКотировки, РежимТоргов, РежимТорговСсылка, ИмяФайла);
	КонецЦикла;
	
КонецПроцедуры

Функция АктуальныеЦенныеБумагиMOEX(ДатаЗагрузки, ТаблицаДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СОКРЛП(ВЫРАЗИТЬ(КодыЗагрузки.Код КАК СТРОКА(1000))) КАК SecurityId,
	|	ЦенныеБумаги.Ссылка КАК Актив,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК RegNumber,
	|	ЦенныеБумаги.ВалютаНоминала КАК ВалютаНоминала
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО КодыЗагрузки.Владелец = ЦенныеБумаги.Ссылка
	|ГДЕ
	|	КодыЗагрузки.Код В(&SecurityIds)
	|	И КодыЗагрузки.Биржа = &ВнешняяСистема
	|	И КодыЗагрузки.Владелец ССЫЛКА Справочник.ЦенныеБумаги
	|	И КодыЗагрузки.ПометкаУдаления = ЛОЖЬ
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ДатаЗагрузки)
	|	И ЦенныеБумаги.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СОКРЛП(ВЫРАЗИТЬ(КодыЗагрузки.Код КАК СТРОКА(1000))),
	|	ЦенныеБумаги.Ссылка,
	|	ЦенныеБумаги.ISIN,
	|	ЦенныеБумаги.НомерРегистрации,
	|	ЦенныеБумаги.ВалютаНоминала";
	
	Запрос.УстановитьПараметр("SecurityIds"		, ТаблицаДанных.ВыгрузитьКолонку("SecurityId"));
	Запрос.УстановитьПараметр("ВнешняяСистема"	, Справочники.Биржи.MICEX);
	Запрос.УстановитьПараметр("ДатаЗагрузки"	, ДатаЗагрузки);
	
	ЦенныеБумаги = Запрос.Выполнить().Выгрузить();
	
	Возврат ЦенныеБумаги;
КонецФункции

Процедура ЗаполнитьТаблицуКотировокЦенныхБумаг(ТаблицаКотировокЦенныхБумаг,
	ЦенныеБумагиMOEX, ДатаЗагрузки, ТаблицаДанных)
	
	УникальныйКлюч = "TradeDate, SecurityId, RegNumber";
	ТаблицаДанных.Индексы.Очистить();
	ТаблицаДанных.Индексы.Добавить(УникальныйКлюч);
	Для Каждого ЦенныеБумаги Из ЦенныеБумагиMOEX Цикл
		ПараметрыПоиска = Новый Структура(УникальныйКлюч, ДатаЗагрузки, ЦенныеБумаги.SecurityId, ЦенныеБумаги.RegNumber);
		АктивыСКотировками = ТаблицаДанных.НайтиСтроки(ПараметрыПоиска);
		Для Каждого СтрокаАктива Из АктивыСКотировками Цикл
			ДобавитьКотировкуВТаблицу(СтрокаАктива, ТаблицаКотировокЦенныхБумаг, ЦенныеБумаги, ДатаЗагрузки);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКотировкуВТаблицу(СтрокаАктива, ТаблицаКотировокЦенныхБумаг, ЦенныеБумаги, ДатаЗагрузки)
	
	СтоПроцентов = 100;
	ВПроцентах = ВРЕГ(СтрокаАктива.PriceType) = "PERC";
	Номинал = СтрокаАктива.FaceValue;
	КоэффициентНоминала = ?(Номинал = 0, СтоПроцентов, Номинал) / СтоПроцентов;
	
	Котировка = ТаблицаКотировокЦенныхБумаг.Добавить();
	// Измерения
	Котировка.Период				 = ДатаЗагрузки;
	Котировка.ЦеннаяБумага			 = ЦенныеБумаги.Актив;
	Котировка.Биржа					 = Справочники.Биржи.MICEX;
	Котировка.РежимТоргов			 = СтрокаАктива.РежимТорговСсылка;
	// Реквизиты
	Если ВПроцентах Тогда
		Котировка.НулевойНКД		 = СтрокаАктива.НулевойНКД;
	КонецЕсли;
	КодВалютыКотировки = ?(ВПроцентах, СтрокаАктива.FaceUnit, СтрокаАктива.CurrencyId);
	ВалютаСКурсом = ВалютаКурсКотировки(КодВалютыКотировки, ЦенныеБумаги.ВалютаНоминала, ЦенныеБумаги.ISIN);
	КурсВалюты = ВалютаСКурсом.Курс;
	Котировка.ВалютаКотировки		 = ВалютаСКурсом.Валюта;
	// Ресурсы
	Для Каждого СоответствиеПолей Из мСоответствиеПолейММВБ Цикл
		Значение = СтрокаАктива[СоответствиеПолей.Ключ];
		СтруктураОтвета = СоответствиеПолей.Значение;
		Если ЗначениеЗаполнено(Значение) Тогда
			Если ВПроцентах И СтруктураОтвета.ВПроцентах Тогда
				Котировка[СтруктураОтвета.Ключ] = Значение * КоэффициентНоминала;
			Иначе
				Котировка[СтруктураОтвета.Ключ] = Значение;
			КонецЕсли;
			Если СтруктураОтвета.Ключ = "AccInt" Тогда
				Котировка.Nkd = Котировка.AccInt * КурсВалюты;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ВалютаКурсКотировки(КодВалютыКотировки, СтрокаАктиваВалютаНоминала, ISIN)
	
	ВалютаСКурсом = мКешВалют[КодВалютыКотировки];
	Если ЗначениеЗаполнено(ВалютаСКурсом) Тогда
		Валюта	 = ВалютаСКурсом.Валюта;
		Курс	 = ВалютаСКурсом.Курс;
	Иначе 
		Валюта	 = Справочники.Валюты.ПустаяСсылка();
		Курс	 = 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Если ЗначениеЗаполнено(СтрокаАктиваВалютаНоминала) Тогда
			Валюта = СтрокаАктиваВалютаНоминала;
			ВалютаСКурсом = мКешВалют[ВРЕГ(СокрЛП(Валюта.Наименование))];
			Курс = ВалютаСКурсом.Курс;
		Иначе
			Если MarketData.ЭтоЦБRu(ISIN) Тогда
				Валюта = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ВалютаРегламентированногоУчета");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("Валюта, Курс", Валюта, Курс);
	
КонецФункции

Процедура ЗагрузитьДанныеВТаблицуДетально(Действие, ТаблицаДанных, ДатаКотировки, РежимТоргов, РежимТорговСсылка, ИмяФайла)
	
	Если Действие = "ФайлММВБ" Тогда
		
		Sem21Records = РежимТоргов.RECORDS;
		Если ТипЗнч(Sem21Records) = Тип("ОбъектXDTO") Тогда
			Sem21Records = Новый Массив;
			Sem21Records.Добавить(РежимТоргов.RECORDS);
		КонецЕсли;
		
		Для Каждого Котировка Из Sem21Records Цикл
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("TradeDate"	, ДатаКотировки);
			ПараметрыПоиска.Вставить("BoardId"		, РежимТоргов.BOARDID);
			ПараметрыПоиска.Вставить("SecurityId"	, Котировка.SecurityId);
			ПараметрыПоиска.Вставить("RegNumber"	, Котировка.RegNumber);
			
			НайденыКотировки = ТаблицаДанных.НайтиСтроки(ПараметрыПоиска);
			Если НайденыКотировки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяКотировка = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяКотировка, РежимТоргов);
			ЗаполнитьЗначенияСвойств(НоваяКотировка, ПараметрыПоиска);
			ЗаполнитьЗначенияСвойств(НоваяКотировка, Котировка);
			НоваяКотировка.РежимТорговСсылка = РежимТорговСсылка;
			НоваяКотировка.ИмяФайла = ИмяФайла;
			// Преобразования
			Если Котировка.Свойства().Получить("MATDATE") = Неопределено Тогда
				НоваяКотировка.MATDATE = Дата("00010101");
			Иначе
				НоваяКотировка.MATDATE = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(Котировка.MATDATE);
			КонецЕсли;
			НоваяКотировка.НулевойНКД = Котировка.Свойства().Получить("AccInt") = Неопределено;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ОбновитьРежимТоргов(РежимТоргов , ЭтоНовыйРежимТоргов)
	
	Обновить = Ложь;
	
	РежимыТорговСсылка = Справочники.РежимыТоргов.РежимТорговПоКоду(РежимТоргов.BoardId);
	Если ЗначениеЗаполнено(РежимыТорговСсылка) Тогда
		РежимыТорговОбъект = РежимыТорговСсылка.ПолучитьОбъект();
		ЭтоНовыйРежимТоргов = Ложь;
	Иначе
		РежимыТорговОбъект = Справочники.РежимыТоргов.СоздатьЭлемент();
		ЭтоНовыйРежимТоргов = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РежимыТорговСсылка.Код) Тогда
		РежимыТорговОбъект.Код = РежимТоргов.BoardId;
		Обновить = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РежимыТорговСсылка.Наименование) Тогда
		РежимыТорговОбъект.Наименование = РежимТоргов.BoardName;
		Обновить = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РежимыТорговСсылка.АнглийскоеНаименование) Тогда
		РежимыТорговОбъект.АнглийскоеНаименование = РежимТоргов.EngBoardName;
		Обновить = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РежимыТорговСсылка.ТипРежимаТоргов) Тогда
		РежимыТорговОбъект.ТипРежимаТоргов = ОбновитьТипРежимаТоргов(РежимТоргов.BoardType);
		Обновить = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(РежимыТорговСсылка.РежимТоргов) Тогда
		РежимыТорговОбъект.РежимТоргов = Перечисления.РежимыТоргов.Рыночная;
		Обновить = Истина;
	КонецЕсли;
	
	Если Обновить Тогда
		РежимыТорговОбъект.ОбменДанными.Загрузка = Истина;
		РежимыТорговОбъект.Записать();
	КонецЕсли;
	
	Возврат РежимыТорговОбъект.Ссылка;
	
КонецФункции

Функция ОбновитьТипРежимаТоргов(BoardType)
	
	Наименование = СокрЛП(BoardType);
	ТипРежимаТорговСсылка = Справочники.ТипыРежимовТоргов.ТипРежимаТорговПоНаименованию(Наименование);
	Если Не ЗначениеЗаполнено(ТипРежимаТорговСсылка) Тогда
		ТипРежимаТорговОбъект = Справочники.ТипыРежимовТоргов.СоздатьЭлемент();
		ТипРежимаТорговОбъект.Наименование = Наименование;
		ТипРежимаТорговОбъект.ОбменДанными.Загрузка = Истина;
		ТипРежимаТорговОбъект.Записать();
		ТипРежимаТорговСсылка = ТипРежимаТорговОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ТипРежимаТорговСсылка;
	
КонецФункции

Функция ЕстьФайлыКотировокММВБ(ДатаКотировки, ВременныйКаталог)
	
	ДатаВИмениФайла = Формат(ДатаКотировки, "ДФ=ддММгг");
	Шаблон00Т_ХМЛ = "*_SEM21_00T_" + ДатаВИмениФайла + "*.xml";
	Шаблон00Т_ЗИП = "*_SEM21_00T_" + ДатаВИмениФайла + "*.zip";
	Шаблон001_ХМЛ = "*_SEM21_001_" + ДатаВИмениФайла + "*.xml";
	Шаблон001_ЗИП = "*_SEM21_001_" + ДатаВИмениФайла + "*.zip";
	
	СессийМаксимум = 2;
	СессийОсталось = СессийМаксимум;
	Пока СессийОсталось > 0 Цикл
		
		ШаблонИмени = ?(СессийОсталось = СессийМаксимум, Шаблон00Т_ХМЛ, Шаблон001_ХМЛ);
		ФайлыSET21 = НайтиФайлы(КаталогДанных, ШаблонИмени);
		Если ФайлыSET21.Количество() > 0 Тогда
			Для Каждого Файл Из ФайлыSET21 Цикл
				ИмяФайлаПриемника = ВременныйКаталог + Файл.Имя;
				КопироватьФайл(Файл.ПолноеИмя, ИмяФайлаПриемника);
				РаботаСФайлами.СнятьПризнакТолькоЧтение(ИмяФайлаПриемника);
				ПереместитьФайлКотировокВАрхив(Файл);
			КонецЦикла;
			Возврат Истина;
		КонецЕсли;
		
		ШаблонИмени = ?(СессийОсталось = СессийМаксимум, Шаблон00Т_ЗИП, Шаблон001_ЗИП);
		ФайлыSET21zip = НайтиФайлы(КаталогДанных, ШаблонИмени);
		Если ФайлыSET21zip.Количество() > 0 Тогда
			РазархивированоУспешно = ОбработатьАрхивSET21(ФайлыSET21zip, ВременныйКаталог);
			Возврат РазархивированоУспешно > 0;
		КонецЕсли;
		
		СессийОсталось = СессийОсталось - 1;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ОбработатьАрхивSET21(ФайлыSET21zip, ВременныйКаталог)
	
	РазархивированоУспешно = 0;
	Для Каждого Файл Из ФайлыSET21zip Цикл
		Попытка
			ЧтениеZip = Новый ЧтениеZipФайла(Файл.ПолноеИмя);
			ФайлZip = ЧтениеZip.Элементы[0];
			ЧтениеZip.Извлечь(ФайлZip, ВременныйКаталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
			ЧтениеZip.Закрыть();
			ИмяФайлаПриемника = ВременныйКаталог + ФайлZip.Имя;
			РаботаСФайлами.СнятьПризнакТолькоЧтение(ИмяФайлаПриемника);
			Если Не СтрЗаканчиваетсяНа(ИмяФайлаПриемника, "xml") Тогда
				УбратьЭлектроннуюПодпись(ИмяФайлаПриемника);
			КонецЕсли;
			ПереместитьФайлКотировокВАрхив(Файл);
			РазархивированоУспешно = РазархивированоУспешно + 1;
		Исключение
			Прервать;
		КонецПопытки;
	КонецЦикла;
	Возврат РазархивированоУспешно;
	
КонецФункции

Функция ПереместитьФайлКотировокВАрхив(Файл)
	
	Успех = Истина;
	Попытка
		КаталогАрхива = Файл.Путь + "Archive\";
		Если Не ОбщегоНазначенияКлиентСервер.ФайлСуществует(КаталогАрхива) Тогда
			СоздатьКаталог(КаталогАрхива);
		КонецЕсли;
		РаботаСФайлами.СнятьПризнакТолькоЧтение(Файл.ПолноеИмя);
		ПутьКАрхиву = КаталогАрхива + Файл.Имя;
		ПереместитьФайл(Файл.ПолноеИмя, ПутьКАрхиву);
	Исключение
		Успех = Ложь;
	КонецПопытки;
	Возврат Успех;
	
КонецФункции

Процедура УбратьЭлектроннуюПодпись(ПолноеИмяФайла)
	
	Чтение = Новый ЧтениеТекста(ПолноеИмяФайла, "windows-1251");
	ФайлСтрокой = Чтение.Прочитать();
	Чтение.Закрыть();
	
	Ключ1 = "<?xml";
	Ключ2 = "</MICEX_DOC>";
	Ключ2Длина = СтрДлина(Ключ2);
	Позиция1 = СтрНайти(ФайлСтрокой, Ключ1);
	Позиция2 = СтрНайти(ФайлСтрокой, Ключ2) + Ключ2Длина;
	ТелоДлина = Позиция2 - Позиция1;
	Тело = Сред(ФайлСтрокой, Позиция1, ТелоДлина);
	
	Запись = Новый ЗаписьТекста(ПолноеИмяФайла + ".xml", "windows-1251");
	Запись.Записать(Тело);
	Запись.Закрыть();
	
	УдалитьФайлы(ПолноеИмяФайла);
	
КонецПроцедуры

Функция ИмяОбъекта()
	
	Возврат "Объект." + Метаданные().Имя;
	
КонецФункции

Функция ПолучитьПериоды(ДатаНач, ДатаКон, ТолькоРабочиеДни = Ложь)
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	
	КвалификаторДаты = ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	
	ТаблицаПериодов.Колонки.Добавить("РезультирующаяДата", КвалификаторДаты);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Календарь.Период КАК РезультирующаяДата
	|ИЗ
	|	РегистрСведений.Календарь КАК Календарь
	|ГДЕ
	|	Календарь.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВЫБОР
	|			КОГДА НЕ &ТолькоРабочиеДни
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Календарь.Значение = ЛОЖЬ
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	РезультирующаяДата";
	
	Запрос.УстановитьПараметр("ТолькоРабочиеДни", ТолькоРабочиеДни);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтрокаПериода = РезультатЗапроса.Выбрать();
	
	Пока СтрокаПериода.Следующий() Цикл
		НоваяСтрокаПериода = ТаблицаПериодов.Добавить();
		НоваяСтрокаПериода.РезультирующаяДата = СтрокаПериода.РезультирующаяДата;
	КонецЦикла;
	
	Возврат ТаблицаПериодов;
	
КонецФункции

Процедура СформироватьКолонкиТаблицы()
	
	ТипЧисло		 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(25, 4, ДопустимыйЗнак.Любой));
	ТипСтрока		 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250, ДопустимаяДлина.Переменная));
	ТипДата			 = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ТипДатаВремя	 = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ТипБулево		 = Новый ОписаниеТипов("Булево");
	
	Типы = Новый Соответствие;
	Типы.Вставить("ТипЧисло"	, ТипЧисло);
	Типы.Вставить("ТипСтрока"	, ТипСтрока);
	Типы.Вставить("ТипДата"		, ТипДата);
	Типы.Вставить("ТипДатаВремя", ТипДатаВремя);
	Типы.Вставить("ТипБулево"	, ТипБулево);
	
	ТаблицаДанных.Колонки.Добавить("TradeDate", ТипДата);
	// Режим торгов
	ТаблицаДанных.Колонки.Добавить("BoardId"		, ТипСтрока, , 1);
	ТаблицаДанных.Колонки.Добавить("BoardName"		, ТипСтрока, , 1);
	ТаблицаДанных.Колонки.Добавить("EngBoardName"	, ТипСтрока, , 1);
	// Ценная бумага
	ТаблицаДанных.Колонки.Добавить("SecurityId"		, ТипСтрока, , 1);
	ТаблицаДанных.Колонки.Добавить("RegNumber"		, ТипСтрока, , 1);
	ТаблицаДанных.Колонки.Добавить("FaceValue"		, ТипЧисло, , 1);
	ТаблицаДанных.Колонки.Добавить("PriceType"		, ТипСтрока, , 1);
	// Валюта ценной бумаги
	ТаблицаДанных.Колонки.Добавить("CurrencyId"		, ТипСтрока, , 1);
	ТаблицаДанных.Колонки.Добавить("FaceUnit"		, ТипСтрока, , 1);
	// Поля котировок
	мСоответствиеПолейММВБ = Обработки.ЗагрузкаКотировок.СоответствиеПолейММВБиРСКотировки();
	Для Каждого Поле Из мСоответствиеПолейММВБ Цикл
		ТаблицаДанных.Колонки.Добавить(Поле.Ключ, Типы[Поле.Значение.Тип], , 1);
	КонецЦикла;
	ТаблицаДанных.Колонки.Добавить("НулевойНКД"			, ТипБулево, , 10);
	ТаблицаДанных.Колонки.Добавить("РежимТорговСсылка"	, Новый ОписаниеТипов("СправочникСсылка.РежимыТоргов"), , 10);
	ТаблицаДанных.Колонки.Добавить("ИмяФайла"			, ТипСтрока, , 10);
	
КонецПроцедуры // СформироватьКолонкиТаблицы()

#КонецОбласти

#Область Инициализация
	СформироватьКолонкиТаблицы();
#КонецОбласти
